In [1]:
# Increase Jupyter display cell-width
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:75% !important; }</style>"))

## Directions for running SQL in Jupyter

In [2]:
# Import libraries
import pandas as pd
import sqlite3
import sql

In [3]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
# Load the SQL module to iPython
%load_ext sql

In [5]:
%sql sqlite:///jupyter_sql_tutorial.db

# <span style="color:orange"><b>Update Sheborgs <i>daily</i></b>!</span>

In [14]:
# %%sql

# INSERT INTO sheborgs
# VALUES (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, NULL, NULL)

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [29]:
# %%sql

# ALTER TABLE sheborgs
# ADD Notes;

In [40]:
# %%sql

# UPDATE sheborgs
# SET gross = 36900000
# WHERE name = 'Ada';

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [41]:
%%sql

SELECT *
FROM sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8, 2019, 200000000, 404000000, None),
 (1, 'Cortana', 21, 'Halo', 9, 2001, None, None, None),
 (2, 'Major', 35, 'Ghost in the Shell', 10, 1989, 110000000, 169800000, None),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5, 1997, None, None, None),
 (4, 'Pris', 3.75, 'Blade Runner', 8, 1982, 30000000, 41500000, None),
 (5, 'Ada', 1, 'Ex Machina', 8, 2014, 15000000, 36900000, None),
 (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, None, None, None)]

## Intro to INNER JOIN

In [9]:
%%sql

SELECT p1.country, p1.continent,
    prime_minister, president
FROM prime_ministers as p1
INNER JOIN presidents as p2
ON p1.country = p2.country;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: prime_ministers
[SQL: SELECT p1.country, p1.continent, prime_minister, president
FROM prime_ministers as p1
INNER JOIN presidents as p2
ON p1.country = p2.country;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [43]:
%%sql

SELECT * 
FROM cities
INNER JOIN countries
ON cities.country_code = countries.code;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: cities
[SQL: SELECT * FROM cities
INNER JOIN countries
ON cities.country_code = countries.code;]
(Background on this error at: http://sqlalche.me/e/e3q8)